using System;
//Даны координаты точки (x, y). Выяснить, принадлежит ли эта точка
//области, указанной на рис. 1, а
static void Main(string[] args)
{
    double x = 3;
    double y = 0;
   
    Console.WriteLine("Точка принадлежит промежутку");
    Console.WriteLine("Точка не принадлежит промежутку"); 
    
}
